const db = require('../config/db')

// แสดงผลลัพธ์การประเมิน แต่ละตัวชี้วัด ในรูปแบบของตาราง และสรุปภาพรวมของผู้รับการประเมินรายบุคคล
exports.getSummryEvaluatee = (req ,res) => {
    try {
        
    }catch(e) {
        err(res, e)
    }
}

// สามารถ Export ออกมาเป็นไฟล์ PDF ได้
// แสดงผลสรุปการประเมินรายกรรมการ (ประเมินผู้รับการประเมินแต่ละคน)
// แสดงรายงานผลการประเมินรายบุคคลได้


// แสดงผลลัพธ์การประเมิน แต่ละตัวชี้วัด ในรูปแบบของตาราง และสรุปภาพรวมของผู้รับการประเมินรายบุคคล
// แดงหัวข้อการประเมิน , ตัวชี้วัดทั้งหมดต่อรอบการประเมิน