// import pagekage
const express = require('express')
const cors = require('cors')
const morgan = require('morgan')
const app = express()
const path = require('path')

// import routes
const auth = require('./routes/auth')
const evaluations = require('./routes/evaluations')
const user = require('./routes/users')
const indicators = require('./routes/indicators')
const assignments = require('./routes/assignments')
const assessments = require('./routes/assessments')
const report = require('./routes/reports')

// middleware
app.use(express.json())
app.use(cors())
app.use(morgan('dev'))
app.use(express.static('uploads'))

// use routes
app.use('/api/auth', auth)
app.use('/api/evaluations', evaluations)
app.use('/api/users', user)
app.use('/api/indicators', indicators)
app.use('/api/assignments', assignments)
app.use('/api/assessments', assessments)
app.use('/api/report/', report)


// Page NotFound
app.use((req ,res) => {
    res.status(404).json({message: "Page NotFound 404"})
})


app.listen(5000, () => console.log('Server Runing! On Port 5000'))



// เปลี่่ยน mobile Responsive
// เอา แพ็กเก็จ.json ไปถ้าจะมี framwork , library
// 

// 5.1 การพัฒนาระบบในส่วนของ งานบุคลากร (14 คะแนน)
// 5.1.1 เพิ่มหัวข้อการประเมินได้ ✅

// 5.1.2 กำหนดช่วงเวลาเปิด/ปิดการประเมินได้ (กำหนดวันเริ่ม – สิ้นสุด) ✅

// 5.1.3 เพิ่มตัวชี้วัดในแต่ละหัวข้อได้ โดยประกอบด้วย ชื่อ, รายละเอียด, น้ำหนักคะแนน, และหลักฐานที่ใช้แนบ ✅

// 5.1.4 กำหนดรูปแบบการประเมินในแต่ละตัวชี้วัด ✅

// กำหนดรูปแบบการประเมินแบบตัวเลือก “มี/ไม่มี” ได้ ✅

// กำหนดรูปแบบการประเมิน แบบสเกลคะแนน 1 – 4 ได้ พร้อมคำอธิบายระดับ: ✅

// 5.1.5 แนบหลักฐานประกอบการประเมินได้ เช่น ไฟล์เอกสาร PDF, ไฟล์รูปภาพ หรือ ที่อยู่ URL ✅

// 5.1.6 จัดการข้อมูลผู้รับการประเมิน ✅

// 5.1.7 เพิ่มรายชื่อกรรมการผู้ประเมินได้ ✅

// 5.1.8 มอบหมายกรรมการให้ประเมินผู้รับการประเมินแต่ละคนได้ ✅

// 5.1.9 กำหนดบทบาทของกรรมการได้ เช่น ประธาน / กรรมการร่วม ✅

// 5.1.10 แสดงผลสรุปการประเมินรายกรรมการ (ประเมินผู้รับการประเมินแต่ละคน)

// 5.1.11 ติดตามสถานะการประเมินของกรรมการแต่ละคนได้ ✅

// 5.1.12 ติดตามสถานะการประเมินของผู้รับการประเมินได้ ✅

// 5.1.13 แสดงรายงานผลการประเมินรายบุคคลได้

// 5.2 การพัฒนาระบบในส่วนของ ผู้รับการประเมิน (8 คะแนน)
// 5.2.1 ลงทะเบียนเพื่อใช้งานระบบได้ พร้อมกรอกข้อมูลเบื้องต้น ✅

// 5.2.2 บันทึก และแก้ไขข้อมูลส่วนตัวเบื้องต้น ✅

// 5.2.3 เพิ่มข้อมูลในแต่ละตัวชี้วัดได้ ✅

// 5.2.4 กรอกคะแนนการประเมินของตนเองได้ ✅

// 5.2.5 บันทึกข้อมูลการประเมินตนเองในแต่ละตัวชี้วัด ✅

// 5.2.6 ดูความคืบหน้าในการดำเนินงานของแต่ละตัวชี้วัด ✅

// 5.2.7 สามารถ Export ออกมาเป็นไฟล์ PDF ได้

// 5.2.8 ดูความคิดเห็นของกรรมการที่ประเมินของตนเองได้ ✅

// 5.3 การพัฒนาระบบในส่วนของ กรรมการผู้ประเมิน (8 คะแนน)
// 5.3.1 แสดงข้อมูลของผู้รับการประเมินที่ต้องประเมิน ✅

// 5.3.2 แสดงหัวข้อ ตัวชี้วัด รายละเอียดข้อมูล และหลักฐานของผู้รับการประเมิน ✅

// 5.3.3 แสดงคะแนนที่ผู้รับการประเมิน ประเมินตนเอง ✅

// 5.3.4 ให้คะแนนผู้รับการประเมินตามตัวชี้วัด ✅

// 5.3.5 กรรมการให้ความคิดเห็นสรุปโดยภาพรวมของการประเมิน ✅

// 5.3.6 แสดงผลลัพธ์การประเมิน แต่ละตัวชี้วัด ในรูปแบบของตาราง และสรุปภาพรวมของผู้รับการประเมินรายบุคคล ✅

// 5.3.7 ลงนามการประเมิน โดยแนบลายเซ็น ✅

// 5.3.8 ยืนยันและส่งผลการประเมิน ✅